## Loading/Exploring the data

Load the iris.csv file into a pandas dataframe. Take a minute to familiarize yourself with the data.

## Import Pandas

Import the `pandas` library as `pd`

In [2]:
from audioop import reverse

import pandas as pd

C:\Users\amish\AppData\Local\Temp\ipykernel_13080\4059898552.py:1: DeprecationWarning: 'audioop' is deprecated and slated for removal in Python 3.13
  from audioop import reverse

Read the `iris.csv` dataset into an object named `iris`

In [19]:
iris = pd.read_csv('iris 1.csv')
iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [20]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
 4   species            150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

How many different species are in this dataset?

In [26]:
iris['species'].unique().size

3

What are their names?

In [29]:
print(iris['species'].unique())

['setosa' 'versicolor' 'virginica']

How many samples are there per species?

<details><summary>Hint</summary>Use the <a href="http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html"><code>.value_counts()</code></a> method</details>

In [23]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [30]:
df = iris.copy()

## Feature Engineering

Create a new column called `'sepal_ratio'` which is equal to sepal width / sepal length

In [31]:
iris['sepal_ratio'] = iris['sepal width (cm)'] / iris['sepal length (cm)']
iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species,sepal_ratio
0,5.1,3.5,1.4,0.2,setosa,0.686275
1,4.9,3.0,1.4,0.2,setosa,0.612245
2,4.7,3.2,1.3,0.2,setosa,0.680851
3,4.6,3.1,1.5,0.2,setosa,0.673913
4,5.0,3.6,1.4,0.2,setosa,0.720000

Create a similar column called `'petal_ratio'`: petal width / petal length

In [32]:
iris['petal_ratio'] = iris['petal width (cm)'] / iris['petal length (cm)']
iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species,sepal_ratio,petal_ratio
0,5.1,3.5,1.4,0.2,setosa,0.686275,0.142857
1,4.9,3.0,1.4,0.2,setosa,0.612245,0.142857
2,4.7,3.2,1.3,0.2,setosa,0.680851,0.153846
3,4.6,3.1,1.5,0.2,setosa,0.673913,0.133333
4,5.0,3.6,1.4,0.2,setosa,0.720000,0.142857

Create 4 columns that correspond to `sepal length (cm)`, `sepal width (cm)`, `petal length (cm)`, and `petal width (cm)`, only in inches.

In [34]:
def to_inches(value):
    return value / 2.54
inches_columns = ['sepal length (in)', 'sepal width (in)', 'petal length (in)', 'petal width (in)']
numeric_columns = ['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']
iris[inches_columns] = iris[numeric_columns].apply(to_inches)


iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species,sepal_ratio,petal_ratio,sepal length (in),sepal width (in),petal length (in),petal width (in)
0,5.1,3.5,1.4,0.2,setosa,0.686275,0.142857,2.007874,1.377953,0.551181,0.07874
1,4.9,3.0,1.4,0.2,setosa,0.612245,0.142857,1.929134,1.181102,0.551181,0.07874
2,4.7,3.2,1.3,0.2,setosa,0.680851,0.153846,1.850394,1.259843,0.511811,0.07874
3,4.6,3.1,1.5,0.2,setosa,0.673913,0.133333,1.811024,1.220472,0.590551,0.07874
4,5.0,3.6,1.4,0.2,setosa,0.720000,0.142857,1.968504,1.417323,0.551181,0.07874

## Apply

Create a column called `'encoded_species'`:
- 0 for setosa
- 1 for versicolor
- 2 for virginica


Hint 1
Create a dictionary using the species as keys and the numbers 0-2 for values


Hint 2
    Use the dictionary in hint 1 with the <code>.apply()</code> method to create the new column

In [35]:
encoded_species = {'setosa' : 0, 'versicolor' : 1, 'virginica' : 2}
iris['encoded_species'] = iris['species'].map(encoded_species)
iris.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species,sepal_ratio,petal_ratio,sepal length (in),sepal width (in),petal length (in),petal width (in),encoded_species
0,5.1,3.5,1.4,0.2,setosa,0.686275,0.142857,2.007874,1.377953,0.551181,0.07874,0
1,4.9,3.0,1.4,0.2,setosa,0.612245,0.142857,1.929134,1.181102,0.551181,0.07874,0
2,4.7,3.2,1.3,0.2,setosa,0.680851,0.153846,1.850394,1.259843,0.511811,0.07874,0
3,4.6,3.1,1.5,0.2,setosa,0.673913,0.133333,1.811024,1.220472,0.590551,0.07874,0
4,5.0,3.6,1.4,0.2,setosa,0.720000,0.142857,1.968504,1.417323,0.551181,0.07874,0

## March Madness

Let's change up the dataset to something different than flowers: March Madness!

Read in the dataset `ncaa-seeds.csv` to an object named `seeds`.

This dataframe simulates the games that will occur in the first round of the [NCAA basketball tournament](http://www.sportingnews.com/au/ncaa-basketball/news/ncaa-tournament-2017-march-madness-bracket-schedule-matchups-print-a-bracket/1r6cau9sb1xj4131zzhay2dj5g). In the first row, you should see the following:

| team_seed | opponent_seed |
|-----------|---------------|
| 01N       | 16N           |

In [45]:
seeds = pd.read_csv('ncaa-seeds 1.csv')
seeds.head(10)

  team_seed opponent_seed
0       01N           16N
1       02N           15N
2       03N           14N
3       04N           13N
4       05N           12N
5       06N           11N
6       07N           10N
7       08N           09N
8       01S           16S
9       02S           15S

For team_seed, the 01 is their seed, and N is their division (North). This row is saying the 1st seed in the north division will play the 16th seed (same division).

Using the `.apply()` method, create the following new columns:
- `team_division`
- `opponent_division`

The first row of your result should look as follows:

| team_seed | opponent_seed | team_division | opponent_division |
|-----------|---------------|---------------|-------------------|
| 01N       | 16N           | N             | N                 |

In [38]:
seeds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   team_seed      32 non-null     object
 1   opponent_seed  32 non-null     object
dtypes: object(2)
memory usage: 644.0+ bytes

In [50]:
seeds['team_division'] = seeds['team_seed'].apply(lambda x: x[2])
seeds['team_seed'] = seeds['team_seed'].apply(lambda x: int(x[:2]))
seeds.head()

   team_seed opponent_seed team_division
0          1           16N             N
1          2           15N             N
2          3           14N             N
3          4           13N             N
4          5           12N             N

In [51]:
seeds['opponent_division'] = seeds['opponent_seed'].apply(lambda x: x[2])
seeds['opponent_seed'] = seeds['opponent_seed'].apply(lambda x: int(x[:2]))
seeds.head()

   team_seed  opponent_seed team_division opponent_division
0          1             16             N                 N
1          2             15             N                 N
2          3             14             N                 N
3          4             13             N                 N
4          5             12             N                 N

Now that you have the divisions, change the `team_seed` and `opponent_seed` columns to just be the numbers.

The first row of your result should look as follows:

| team_seed | opponent_seed | team_division | opponent_division |
|-----------|---------------|---------------|-------------------|
| 1         | 16            | N             | N                 |

In [52]:
seeds.head()

   team_seed  opponent_seed team_division opponent_division
0          1             16             N                 N
1          2             15             N                 N
2          3             14             N                 N
3          4             13             N                 N
4          5             12             N                 N

Create a new column called seed_delta, which is the difference between the team's seed and their opponent's. 

The first row of your result should look as follows:

| team_seed | opponent_seed | team_division | opponent_division | seed_delta |
|-----------|---------------|---------------|-------------------|------------|
| 1         | 16            | N             | N                 | -15        |

<br>
<details><summary>Did you get an error?</summary>
team_seed and opponent_seed need to be numerical columns in order for you to perform mathematical operations on them.
</details>

In [53]:
seeds['seed_delta'] = seeds['team_seed'] - seeds['opponent_seed']
seeds.head()

   team_seed  opponent_seed team_division opponent_division  seed_delta
0          1             16             N                 N         -15
1          2             15             N                 N         -13
2          3             14             N                 N         -11
3          4             13             N                 N          -9
4          5             12             N                 N          -7